{
  "1.0.0": {
    "en": "First version!",
    "nl": "Eerste versie!",
    "de": "Erste Version!",
    "fr": "Première version !",
    "es": "¡Primera versión!",
    "it": "Prima versione!",
    "sv": "Första versionen!",
    "no": "Første versjon!",
    "da": "Første version!",
    "pl": "Pierwsza wersja!"
  },
  "1.0.1": {
    "en": "Added community topic",
    "nl": "Community topic toegevoegd",
    "de": "Community-Thema hinzugefügt",
    "fr": "Sujet communautaire ajouté",
    "es": "Tema de la comunidad añadido",
    "it": "Argomento della community aggiunto",
    "sv": "Lagt till community-ämne",
    "no": "Lagt til community-emne",
    "da": "Tilføjet community-emne",
    "pl": "Dodano temat społeczności"
  },
  "1.0.2": {
    "en": "- Added: Multi-channel device support (e.g., Fibaro Walli switches with multiple outputs)\n- Fixed: Reduced storage writes to protect eMMC lifespan (per-device storage instead of saving all devices)\n- Fixed: Optimized memory usage by reusing single HomeyAPI instance instead of recreating multiple times\n- Fixed: Optimized polling interval (5s → 5 min)\n- Fixed: Prevent duplicate event recording from listener bugs",
    "nl": "- Toegevoegd: Ondersteuning voor multi-channel apparaten (bijv. Fibaro Walli schakelaars met meerdere uitgangen)\n- Opgelost: Verminderde opslagopdrachten om eMMC levensduur te beschermen (per-apparaat opslag in plaats van alle apparaten opslaan)\n- Opgelost: Geoptimaliseerd geheugengebruik door hergebruik van enkele HomeyAPI instantie in plaats van meerdere keren aanmaken\n- Opgelost: Geoptimaliseerd polling-interval (5s → 5 min)\n- Opgelost: Voorkom dubbele event registratie door listener bugs",
    "de": "- Hinzugefügt: Mehrkanalgeräte-Unterstützung (z.B. Fibaro Walli-Schalter mit mehreren Ausgängen)\n- Behoben: Reduzierte Speicherzugriffe zum Schutz der eMMC-Lebensdauer (gerätespezifische Speicherung statt Speichern aller Geräte)\n- Behoben: Optimierte Speichernutzung durch Wiederverwendung einer einzelnen HomeyAPI-Instanz statt mehrfacher Neuerstellung\n- Behoben: Optimiertes Polling-Intervall (5s → 5 min)\n- Behoben: Verhindert doppelte Event-Aufzeichnung durch Listener-Fehler",
    "fr": "- Ajouté : Prise en charge des appareils multi-canaux (par ex. interrupteurs Fibaro Walli avec plusieurs sorties)\n- Corrigé : Réduction des écritures de stockage pour protéger la durée de vie de l'eMMC (stockage par appareil au lieu de sauvegarder tous les appareils)\n- Corrigé : Optimisation de l'utilisation de la mémoire en réutilisant une seule instance HomeyAPI au lieu de la recréer plusieurs fois\n- Corrigé : Optimisation de l'intervalle de polling (5s → 5 min)\n- Corrigé : Empêche l'enregistrement d'événements en double dus aux bugs de listener",
    "es": "- Añadido: Soporte para dispositivos multicanal (p. ej., interruptores Fibaro Walli con múltiples salidas)\n- Corregido: Escrituras de almacenamiento reducidas para proteger la vida útil del eMMC (almacenamiento por dispositivo en lugar de guardar todos los dispositivos)\n- Corregido: Uso de memoria optimizado reutilizando una única instancia de HomeyAPI en lugar de recrearla múltiples veces\n- Corregido: Intervalo de sondeo optimizado (5s → 5 min)\n- Corregido: Previene el registro de eventos duplicados por errores de listener",
    "it": "- Aggiunto: Supporto per dispositivi multicanale (ad es. interruttori Fibaro Walli con più uscite)\n- Risolto: Ridotte le scritture di archiviazione per proteggere la durata dell'eMMC (archiviazione per dispositivo invece di salvare tutti i dispositivi)\n- Risolto: Ottimizzato l'uso della memoria riutilizzando una singola istanza HomeyAPI invece di ricrearla più volte\n- Risolto: Ottimizzato intervallo di polling (5s → 5 min)\n- Risolto: Previene la registrazione di eventi duplicati da bug del listener",
    "sv": "- Tillagt: Stöd för flerkanalsenheter (t.ex. Fibaro Walli-brytare med flera utgångar)\n- Fixat: Reducerade lagringsskrivningar för att skydda eMMC-livslängd (lagring per enhet istället för att spara alla enheter)\n- Fixat: Optimerad minnesanvändning genom återanvändning av en enda HomeyAPI-instans istället för att återskapa flera gånger\n- Fixat: Optimerat pollningsintervall (5s → 5 min)\n- Fixat: Förhindrar duplicerad händelseregistrering från listener-buggar",
    "no": "- Lagt til: Støtte for flerkanalenheter (f.eks. Fibaro Walli-brytere med flere utganger)\n- Rettet: Reduserte lagringsskriving for å beskytte eMMC-levetid (lagring per enhet i stedet for å lagre alle enheter)\n- Rettet: Optimalisert minnebruk ved å gjenbruke én enkelt HomeyAPI-instans i stedet for å gjenskape flere ganger\n- Rettet: Optimalisert avstemningsintervall (5s → 5 min)\n- Rettet: Forhindrer duplisert hendelsesregistrering fra listener-feil",
    "da": "- Tilføjet: Understøttelse af multi-kanal enheder (f.eks. Fibaro Walli switches med flere udgange)\n- Rettet: Reducerede lagerskrivninger for at beskytte eMMC-levetid (lagring pr. enhed i stedet for at gemme alle enheter)\n- Rettet: Optimeret hukommelsesbrug ved at genbruge en enkelt HomeyAPI-instans i stedet for at genskabe flere gange\n- Rettet: Optimeret pollinginterval (5s → 5 min)\n- Rettet: Forhindrer dubleret hændelsesregistrering fra listener-fejl",
    "pl": "- Dodano: Obsługa urządzeń wielokanałowych (np. przełączniki Fibaro Walli z wieloma wyjściami)\n- Naprawiono: Zmniejszono zapisy do pamięci w celu ochrony żywotności eMMC (przechowywanie per urządzenie zamiast zapisywania wszystkich urządzeń)\n- Naprawiono: Zoptymalizowano użycie pamięci poprzez ponowne użycie pojedynczej instancji HomeyAPI zamiast wielokrotnego tworzenia\n- Naprawiono: Zoptymalizowano interwał odpytywania (5s → 5 min)\n- Naprawiono: Zapobiega duplikowaniu rejestrowania zdarzeń z powodu błędów listenera"
  },
  "1.0.3": {
    "en": "- Fixed: 'Last activity' indicator showed oldest event instead of most recent event\n- Fixed: Singular/plural forms now display correctly (e.g., '1 day ago' instead of '1 day/days ago')\n- Fixed: Tuned light background greys so that dark mode inversion yields a softer dark grey instead of harsh pure black.",
    "nl": "- Opgelost: 'Laatste activiteit' indicator toonde oudste gebeurtenis in plaats van meest recente gebeurtenis\n- Opgelost: Enkelvoud/meervoud vormen worden nu correct weergegeven (bijv. '1 dag geleden' in plaats van '1 dag/dagen geleden')\n- Opgelost: Lichte achtergrondgrijstinten aangepast zodat donkere modus inversie een zachtere donkergrijze kleur oplevert in plaats van hard puur zwart.",
    "de": "- Behoben: 'Letzte Aktivität'-Anzeige zeigte ältestes Ereignis statt neuestes Ereignis\n- Behoben: Singular-/Pluralformen werden jetzt korrekt angezeigt (z.B. 'vor 1 Tag' statt 'vor 1 Tag/Tagen')\n- Behoben: Helle Hintergrundgrautöne optimiert, sodass die Dunkelmodus-Invertierung ein weicheres Dunkelgrau statt hartem reinen Schwarz ergibt.",
    "fr": "- Corrigé : L'indicateur 'Dernière activité' affichait l'événement le plus ancien au lieu du plus récent\n- Corrigé : Les formes singulier/pluriel s'affichent désormais correctement (par ex. 'il y a 1 jour' au lieu de 'il y a 1 jour/jours')\n- Corrigé : Ajustement des gris de fond clairs pour que l'inversion du mode sombre produise un gris foncé plus doux au lieu d'un noir pur agressif.",
    "es": "- Corregido: El indicador 'Última actividad' mostraba el evento más antiguo en lugar del más reciente\n- Corregido: Las formas singular/plural ahora se muestran correctamente (p. ej., 'hace 1 día' en lugar de 'hace 1 día/días')\n- Corregido: Ajustados los grises de fondo claro para que la inversión del modo oscuro produzca un gris oscuro más suave en lugar de un negro puro intenso.",
    "it": "- Risolto: L'indicatore 'Ultima attività' mostrava l'evento più vecchio invece del più recente\n- Risolto: Le forme singolare/plurale ora vengono visualizzate correttamente (ad es. '1 giorno fa' invece di '1 giorno/giorni fa')\n- Risolto: Ottimizzati i grigi dello sfondo chiaro in modo che l'inversione della modalità scura produca un grigio scuro più morbido invece di un nero puro intenso.",
    "sv": "- Fixat: 'Senaste aktivitet'-indikatorn visade äldsta händelsen istället för den senaste händelsen\n- Fixat: Singular-/pluralformer visas nu korrekt (t.ex. 'för 1 dag sedan' istället för 'för 1 dag/dagar sedan')\n- Fixat: Justerade ljusa bakgrundsgråtoner så att mörkt läge-inversionen ger ett mjukare mörkgrått istället för hårt rent svart.",
    "no": "- Rettet: 'Siste aktivitet'-indikatoren viste eldste hendelse i stedet for nyeste hendelse\n- Rettet: Entall/flertallsformer vises nå korrekt (f.eks. 'for 1 dag siden' i stedet for 'for 1 dag/dager siden')\n- Rettet: Justerte lyse bakgrunnsgrå-toner slik at inversjon i mørk modus gir en mykere mørkegrå i stedet for hard ren svart.",
    "da": "- Rettet: 'Seneste aktivitet'-indikatoren viste ældste hændelse i stedet for nyeste hændelse\n- Rettet: Ental/flertal-former vises nu korrekt (f.eks. 'for 1 dag siden' i stedet for 'for 1 dag/dage siden')\n- Rettet: Justerede lyse baggrundsgrå-toner, så mørk tilstand-inversionen giver en blødere mørkegrå i stedet for hård ren sort.",
    "pl": "- Naprawiono: Wskaźnik 'Ostatnia aktywność' pokazywał najstarsze zdarzenie zamiast najnowszego\n- Naprawiono: Formy liczby pojedynczej/mnogiej są teraz wyświetlane poprawnie (np. '1 dzień temu' zamiast '1 dzień/dni temu')\n- Naprawiono: Dostosowano jasne odcienie szarości tła, aby inwersja trybu ciemnego dawała miększą ciemnoszarą barwę zamiast ostrej czystej czerni."
  }
}